app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY title ASC LIMIT 20
---
  def index
    # productsテーブルから最新順に作品を２０件取得する
    @products = Product.all.order('title ASC').limit(20)