app/views/products/index.html.erb


                      <% if product.reviews.present? %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 76